content/foss.org
#+title: Open Source Open Science
#+AUTHOR: Peter Polidoro
#+EMAIL: peter@polidoro.io

* Free and Open Source Software (FOSS)

- The freedom to run the program as you wish, for any purpose.
- The freedom to study how the program works, and change it so it does your
  computing as you wish. Access to the source code is a precondition for this.
- The freedom to redistribute copies so you can help others.
- The freedom to distribute copies of your modified versions to others. By doing
  this, you can give the whole community a chance to benefit from your changes.


[[./index.org][Home]] [[./share-source.org][Previous]] [[./runtime-environment.org][Next]]

