foss.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Open Source Open Science</title>
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" href="css/terminal.css" />
</head>
<body>
<div id="content" class="content">

<div id="outline-container-orga7bfaea" class="outline-2">
<h2 id="orga7bfaea">Free and Open Source Software (FOSS)</h2>
<div class="outline-text-2" id="text-orga7bfaea">
<ul class="org-ul">
<li>The freedom to run the program as you wish, for any purpose.</li>
<li>The freedom to study how the program works, and change it so it does your
computing as you wish. Access to the source code is a precondition for this.</li>
<li>The freedom to redistribute copies so you can help others.</li>
<li>The freedom to distribute copies of your modified versions to others. By doing
this, you can give the whole community a chance to benefit from your changes.</li>
</ul>


<p>
<a href="./index.html">Home</a> <a href="./share-source.html">Previous</a> <a href="./runtime-environment.html">Next</a>
</p>
</div>
</div>
</div>
</body>
</html>
